___

<a href='http://www.pieriandata.com'> <img src='../Pierian_Data_Logo.png' /></a>
___

# Groupby

The groupby method allows you to group rows of data together and call aggregate functions

In [44]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350],
       'Total Revenue':[1000,800,1200,600,900,1100]}

In [45]:
df = pd.DataFrame(data)

In [46]:
df

  Company   Person  Sales  Total Revenue
0    GOOG      Sam    200           1000
1    GOOG  Charlie    120            800
2    MSFT      Amy    340           1200
3    MSFT  Vanessa    124            600
4      FB     Carl    243            900
5      FB    Sarah    350           1100

** Now you can use the .groupby() method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object:**

In [47]:
df.groupby('Company')

You can save this object as a new variable:

In [48]:
by_comp = df.groupby("Company")

And then call aggregate methods off the object:

In [49]:
by_comp.mean(numeric_only=True)

         Sales  Total Revenue
Company
FB       296.5         1000.0
GOOG     160.0          900.0
MSFT     232.0          900.0

In [50]:
df.groupby('Company').mean(numeric_only=True)

         Sales  Total Revenue
Company
FB       296.5         1000.0
GOOG     160.0          900.0
MSFT     232.0          900.0

More examples of aggregate methods:

In [51]:
by_comp.std(numeric_only=True)

              Sales  Total Revenue
Company
FB        75.660426     141.421356
GOOG      56.568542     141.421356
MSFT     152.735065     424.264069

In [52]:
by_comp.min(numeric_only=True)

         Sales  Total Revenue
Company
FB         243            900
GOOG       120            800
MSFT       124            600

In [53]:
by_comp.max(numeric_only=True)

         Sales  Total Revenue
Company
FB         350           1100
GOOG       200           1000
MSFT       340           1200

In [54]:
by_comp.count()

         Person  Sales  Total Revenue
Company
FB            2      2              2
GOOG          2      2              2
MSFT          2      2              2

In [55]:
by_comp.describe()

        Sales                                                          \
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

        Total Revenue                                                    \
                count    mean         std    min    25%     50%     75%
Company
FB                2.0  1000.0  141.421356  900.0  950.0  1000.0  1050.0
GOOG              2.0   900.0  141.421356  800.0  850.0   900.0   950.0
MSFT              2.0   900.0  424.264069  600.0  750.0   900.0  1050.0


            max
Company
FB       1100.0
GOOG     1000.0
MSFT     1200.0

In [59]:
df.describe()

            Sales  Total Revenue
count    6.000000       6.000000
mean   229.500000     933.333333
std    100.899455     216.024690
min    120.000000     600.000000
25%    143.000000     825.000000
50%    221.500000     950.000000
75%    315.750000    1075.000000
max    350.000000    1200.000000

In [60]:
df.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
Sales,6.0,229.500000,100.899455,120.0,143.0,221.5,315.75,350.0
Total Revenue,6.0,933.333333,216.024690,600.0,825.0,950.0,1075.00,1200.0

In [56]:
by_comp.describe().transpose()

Company                       FB         GOOG         MSFT
Sales         count     2.000000     2.000000     2.000000
              mean    296.500000   160.000000   232.000000
              std      75.660426    56.568542   152.735065
              min     243.000000   120.000000   124.000000
              25%     269.750000   140.000000   178.000000
              50%     296.500000   160.000000   232.000000
              75%     323.250000   180.000000   286.000000
              max     350.000000   200.000000   340.000000
Total Revenue count     2.000000     2.000000     2.000000
              mean   1000.000000   900.000000   900.000000
              std     141.421356   141.421356   424.264069
              min     900.000000   800.000000   600.000000
              25%     950.000000   850.000000   750.000000
              50%    1000.000000   900.000000   900.000000
              75%    1050.000000   950.000000  1050.000000
              max    1100.000000  1000.000000  1200.000000

In [57]:
by_comp.describe().transpose()['GOOG']

Sales          count       2.000000
               mean      160.000000
               std        56.568542
               min       120.000000
               25%       140.000000
               50%       160.000000
               75%       180.000000
               max       200.000000
Total Revenue  count       2.000000
               mean      900.000000
               std       141.421356
               min       800.000000
               25%       850.000000
               50%       900.000000
               75%       950.000000
               max      1000.000000
Name: GOOG, dtype: float64

# Great Job!